{
 "displayTopicName": "Informed Abridgement",
 "paragraphsBySubtopic": {
  "Informed Abridgement": [
   {
    "text": "Informed abridgement is the idea that whereas ",
    "type": "text"
   },
   {
    "text": "other mediums abridge without informing the reader",
    "type": "local",
    "targetSubtopic": "Other mediums abridge without informing the reader",
    "targetTopic": "Informed Abridgement",
    "enclosingTopic": "Informed Abridgement",
    "enclosingSubtopic": "Informed Abridgement"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "in a Canopy project the reader makes an informed decision about when to stop reading",
    "type": "local",
    "targetSubtopic": "In a Canopy project the reader makes an informed decision about when to stop reading",
    "targetTopic": "Informed Abridgement",
    "enclosingTopic": "Informed Abridgement",
    "enclosingSubtopic": "Informed Abridgement"
   },
   {
    "text": ", and thus ",
    "type": "text"
   },
   {
    "text": "the reader has a better sense of their level of knowledge",
    "type": "local",
    "targetSubtopic": "The reader has a better sense of their level of knowledge",
    "targetTopic": "Informed Abridgement",
    "enclosingTopic": "Informed Abridgement",
    "enclosingSubtopic": "Informed Abridgement"
   },
   {
    "text": ".",
    "type": "text"
   }
  ],
  "Other mediums abridge without informing the reader": [
   {
    "text": "When an expert writes in a popular publication, they will often simplify concepts and leave out opposing views due to the limitations of the venue, all without informing the reader of this, and so the reader doesn't know how much they don't know about the subject.",
    "type": "text"
   }
  ],
  "In a Canopy project the reader makes an informed decision about when to stop reading": [
   {
    "text": "In a Canopy project, an expert can include all relevant information on a subject, and so the reader can begin with a brief description that mentions the existence of more information, and if they request that information, it will mention the existence of still more information, and so at each level of detail, the reader is notified of what else there is to know, so that if they decide to stop reading, it is with full knowledge that they haven't seen everything there was to read.",
    "type": "text"
   }
  ],
  "The reader has a better sense of their level of knowledge": [
   {
    "text": "If the reader is offered more information and makes an informed decision to stop reading, then they will be much more modest in their self-appraisal because they know they are missing information, not like the reader of a popular publication.",
    "type": "text"
   }
  ]
 }
}