{
 "displayTopicName": "Library science",
 "paragraphsBySubtopic": {
  "Library science": [
   {
    "text": "Canopy would allow the creation of new types of work that synthesized information from multiple sources, ",
    "type": "text"
   },
   {
    "text": "showing all the information related to a point in a classic work",
    "type": "local",
    "targetSubtopic": "Showing all the information related to a point in a classic work",
    "targetTopic": "Library science",
    "enclosingTopic": "Library science",
    "enclosingSubtopic": "Library science"
   },
   {
    "text": ", or ",
    "type": "text"
   },
   {
    "text": "all the words that discuss a given point",
    "type": "local",
    "targetSubtopic": "All the words that discuss a given point",
    "targetTopic": "Library science",
    "enclosingTopic": "Library science",
    "enclosingSubtopic": "Library science"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "without taking any content positions",
    "type": "local",
    "targetSubtopic": "Without taking any content positions",
    "targetTopic": "Library science",
    "enclosingTopic": "Library science",
    "enclosingSubtopic": "Library science"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "similar to the speech of a librarian",
    "type": "local",
    "targetSubtopic": "Similar to the speech of a librarian",
    "targetTopic": "Library science",
    "enclosingTopic": "Library science",
    "enclosingSubtopic": "Library science"
   },
   {
    "text": ".",
    "type": "text"
   }
  ],
  "Showing all the information related to a point in a classic work": [
   {
    "text": "For a given paragraph in a classic work, librarians could assemble all the commentary on that specific point, and all the commentary on those commentaries, and so on.",
    "type": "text"
   }
  ],
  "All the words that discuss a given point": [
   {
    "text": "Rather than start from an existing work, librarians could produce a general description of a domain, and assemble specifications and perspectives from different works on each detail, allowing readers to burrow and discover what discussions exist in each domain, and to access the specific portions of the original sources involved in the discussion.",
    "type": "text"
   }
  ],
  "Without taking any content positions": [
   {
    "text": "Such works would never have to take positions on what is actually true, because their job would just be to say what has been said on a given subject, and so as long as everyone agrees on what has been said, it should be uncontroversial to produce such a structure even if the individuals doing it disagree strongly in their content views.",
    "type": "text"
   }
  ],
  "Similar to the speech of a librarian": [
   {
    "text": "We can think of librarian speech as being a genre of writing, things that a librarian might tell you about the sorts of works that are available, and which works discuss which points. Just as a librarian would not take positions even on very obvious points, so too would such works merely point the reader in the direction of notable works that discuss a given question.",
    "type": "text"
   }
  ]
 }
}