{
 "displayTopicName": "Many small categories",
 "paragraphsBySubtopic": {
  "Many small categories": [
   {
    "text": "Many small categories is the idea that ",
    "type": "text"
   },
   {
    "text": "the number of categories in a conventional classification scheme is limited",
    "type": "local",
    "targetSubtopic": "The number of categories in a conventional classification scheme is limited",
    "targetTopic": "Many small categories",
    "enclosingTopic": "Many small categories",
    "enclosingSubtopic": "Many small categories"
   },
   {
    "text": ", which causes ",
    "type": "text"
   },
   {
    "text": "overly large categories",
    "type": "local",
    "targetSubtopic": "Overly large categories",
    "targetTopic": "Many small categories",
    "enclosingTopic": "Many small categories",
    "enclosingSubtopic": "Many small categories"
   },
   {
    "text": ", whereas ",
    "type": "text"
   },
   {
    "text": "categories in Canopy can be deeply nested",
    "type": "local",
    "targetSubtopic": "Categories in Canopy can be deeply nested",
    "targetTopic": "Many small categories",
    "enclosingTopic": "Many small categories",
    "enclosingSubtopic": "Many small categories"
   },
   {
    "text": ".",
    "type": "text"
   }
  ],
  "The number of categories in a conventional classification scheme is limited": [
   {
    "text": "Most organizational systems have categories which contain subtcategories, and the subcategories may contain subcategories, but there will only be 2-4 levels of nested subcategories, after which things are added to the subcategories in an undifferentiated list.",
    "type": "text"
   }
  ],
  "Overly large categories": [
   {
    "text": "When categories can only be nested 2-4 levels, if the corpus is large, then the size of categories will get very large also, and if a category is very large, it becomes intractable for the reader to see the whole list and it becomes random what content they see or don't see when navigating to a category.",
    "type": "text"
   }
  ],
  "Categories in Canopy can be deeply nested": [
   {
    "text": "In Canopy, categories can be deeply nested because the content itself is the categorization scheme, and so categories of content can be nested very deeply, and thus there can be very many categories, each of which contain only a few things, so the user who navigates to a given category will be able to see everything it contains and it will not be random which contents get seen or not seen, producing a more precise experience for the reader.",
    "type": "text"
   }
  ]
 }
}