{"displayTopicName":"Memorability","topicTokens":[{"text":"Memorability","type":"text"}],"paragraphsBySubtopic":{"Memorability":[{"text":"Memory entails associating a cue with a response","type":"local","tokens":[{"text":"Memory entails associating a cue with a response","type":"text"}],"targetSubtopic":"Memory entails associating a cue with a response","targetTopic":"Memorability","enclosingTopic":"Memorability","enclosingSubtopic":"Memorability"},{"text":" which is achieved by ","type":"text"},{"text":"seeing the cue alone before the response","type":"local","tokens":[{"text":"seeing the cue alone before the response","type":"text"}],"targetSubtopic":"Seeing the cue alone before the response","targetTopic":"Memorability","enclosingTopic":"Memorability","enclosingSubtopic":"Memorability"},{"text":" but ","type":"text"},{"text":"traditional prose presents information as a single unit","type":"local","tokens":[{"text":"traditional prose presents information as a single unit","type":"text"}],"targetSubtopic":"Traditional prose presents information as a single unit","targetTopic":"Memorability","enclosingTopic":"Memorability","enclosingSubtopic":"Memorability"},{"text":", so ","type":"text"},{"text":"Canopy presents information in stages","type":"local","tokens":[{"text":"Canopy presents information in stages","type":"text"}],"targetSubtopic":"Canopy presents information in stages","targetTopic":"Memorability","enclosingTopic":"Memorability","enclosingSubtopic":"Memorability"},{"text":", and ","type":"text"},{"text":"this will make content easier to remember","type":"local","tokens":[{"text":"this will make content easier to remember","type":"text"}],"targetSubtopic":"This will make content easier to remember","targetTopic":"Memorability","enclosingTopic":"Memorability","enclosingSubtopic":"Memorability"},{"text":".","type":"text"}],"Memory entails associating a cue with a response":[{"text":"It seems that the major systems of memory create associations so that one particular thought brings to mind another, and so when we think about teaching students a certain corpus, we have to be clear about what specific cues we want them to recognize, and what specific responses we want them to think of when they see those cues.","type":"text"}],"Seeing the cue alone before the response":[{"text":"In order to make someone remember to buy milk when they pass the grocery store, they should think about \"passing the grocery store\" by itself, and then think about getting milk, so that when they are in the real world and are passing the grocery store, the idea of passing the store by itself brings the idea of getting milk to mind. If they merely review the idea of \"getting milk when passing the grocery store\" as one big unit, then they are associating the task in memory with itself, and so the situation of \"passing the store\" by itself might not bring it to mind, defeating the purpose of memorization.","type":"text"}],"Traditional prose presents information as a single unit":[{"text":"When I learn information about New York, I want that information to be the \"response\" that comes to mind when I think about the \"cue\" of New York. Prose, however, presents me the cue and the response all as one unit, and so I am not practicing retrieval of the content by topic name, but rather, I am practicing retrieval of the content by content, which isn't helpful.","type":"text"}],"Canopy presents information in stages":[{"text":"Canopy presents a brief paragraph that mentions a few entities by name, and only once the user interacts with a topic name does the user see more information, so the \"cue\" of the topic name is seen before the \"response\" of the topic's paragraph.","type":"text"}],"This will make content easier to remember":[{"text":"In Canopy, the reader sees the \"cue\" of the link before the \"response\" of the child paragraph, and so the reader is being trained to expect the paragraph when they see the topic name alone, creating a vast network of cues that trigger responses which contain in them multiple further cues, producing mental structures that will enable the reader to reliably retrieve later the new information they are receiving, preventing \"orphans\" where information is learned but without creating a cue by which to access it later.","type":"text"}]}}